sdaiCreateNestedAggrByItrADB(Sdai_ItrId*,Sdai_ADBId*)
\details
Creates an aggregate instance that replaces the current member of an aggregate instance referenced by a specified iterator.
\param current         [in]  An iterator that refers to the current member of the aggregate.
\param selaggrInstance [in] An attribute data block (ADB) that specifies the type of the aggregate to create.
\returns The identifier of the newly created aggregate instance.